{
  "lang": "ru",
  "screens": {
    "main": "Добро пожаловать",
    "home": "Главная",
    "instructions": "Инструкции",
    "math": "Математические примеры",
    "schoolProgram": "Школьная программа 1-3 классы",
    "preSchool": "Подготовка к школе",
    "login": "Вход",
    "register": "Регистрация",
    "verify": "Верификация",
    "logout": "Выход",
    "forgotPassword": "Забыли пароль",
    "createNewPassword": "Создание нового пароля",
    "changeEmail": "Изменить email",
    "changePassword": "Изменить пароль",
    "changeAvatar": "Выбрать аватар",
    "profile": "Профайл",
    "yourScore": "Ваш счет"
  },
  "main": {
    "desc": "Это веб-версия мобильного приложения. Оно находится в режиме разработки"
  },
  "changeLang": {
    "select": "Выбор языка",
    "options": {
      "en": "Английский",
      "ru": "Русский"
    }
  },
  "buttons": {
    "submit": "Отправить",
    "logout": "Выйти",
    "login": "Вход",
    "register": "Регистрация"
  },
  "modal": {
    "registrationSuccess": "Регистрация прошла успешно",
    "changePasswordSuccess": "Вы успешно поменяли пароль",
    "fail": "Что-то пошло не так. Пожалуйста, попробуйту позже",
    "linkSent": "Пожалуйста, проверьте вашу почту",
    "forgotPassword": "Пожалуйста, проверьте ваш email",
    "checkMathOperationSuccess": "Верно!",
    "checkMathOperationFail": "Неверно! Попробуйте еще раз",
    "changeAvatarSuccess": "Вы успешно поменяли аватар",
    "button": "Ok"
  },
  "links": {
    "back": "Назад"
  },
  "errors": {
    "serverError": "Нет связи с сервером. Пожалуйста, попробуйте позже",
    "someError": "Какая-то ошибка:(",
    "error400register": "Пользователь с таким email уже существует",
    "error400login": "Неверный пароль",
    "error401login": "Пользователь не найден",
    "required": "Обязательное поле",
    "latinLetters": "Tолько латинские буквы",
    "min": "Минимальная длина поля 4 символа",
    "max": "Максимальная длина поля 64 символа",
    "notMatch": "Пароли не совпадают",
    "mustBeEmail": "Email должен быть email",
    "logout": "Вы не авторизованы, залогиньтесь, тогда вы сможете выйти"
  },
  "auth": {
    "changePassword": {
      "inputs": {
        "password": {
          "label": "Ваш старый пароль",
          "placeholder": "Введите ваш старый пароль"
        },
        "newPassword": {
          "label": "Ваш новый пароль",
          "placeholder": "Введите ваш новый пароль"
        },
        "newPasswordConfirmation": {
          "label": "Подтверждение пароля",
          "placeholder": "Подтвердите ваш новый пароль"
        }
      }
    },
    "changeEmail": {
      "inputs": {
        "newEmail": {
          "label": "Ваш новый email",
          "placeholder": "Введите ваш новый email"
        }
      }
    },
    "login": {
      "inputs": {
        "email": {
          "label": "Электронная почта",
          "placeholder": "Введите ваш email"
        },
        "password": {
          "label": "Пароль",
          "placeholder": "Введите ваш пароль"
        },
        "rememberMe": "Запомнить меня"
      },
      "note": "Если у вас нет аккаунта, пройдите регистрацию"
    },
    "register": {
      "inputs": {
        "passwordConfirmation": {
          "label": "Подтверждение пароля",
          "placeholder": "Подтвердите ваш пароль"
        }
      },
      "note": "Если у вас уже есть аккаунт, пройдите на страницу входа"
    },
    "logout": {
      "sure": "Вы уверены?"
    },
    "verify": {
      "success": "Ваш email подтвержден успешно",
      "error": "Возникла ошбка при верификации, пройдите регистрацию повторно"
    },
    "forgotPassword": {
      "note": "Если вы забыли пароль проследуйте по ссылке ниже"
    }
  },
  "home": {
    "hello": "Привет"
  },
  "mathOperations": {
    "common": {
      "generate": "Сгенерировать новые числа",
      "generateCats": "Сгенерировать новых кошек",
      "check": "Проверить",
      "right": "Вы правы!",
      "notRight": "Вы не правы",
      "more": "Играть еще?",
      "again": "Попробовать еще раз?",
      "choose": "Выбери число:",
      "getHint": "Подсказка"
    },
    "diff": "Разность/Вычитание",
    "sum": "Сумма/Сложение",
    "multiplication": "Произведение/Умножение",
    "multTable": "Таблица умножения",
    "multBy": "Умножение на",
    "multCheck": "Проверить знание таблицы умножения",
    "multNulls": "Умножение чисел с нулями",
    "equations": "Уравнения",
    "equationsWithX": "Уравнения с 1 неизвестным",
    "equationsWithXY": "Уравнения с 2 неизвестными"
  },
  "preSchool": {
    "numbers": {
      "title": "Числа",
      "desc": "Сосчитай кошек"
    },
    "sum": {
      "title": "Сумма",
      "desc": "Сложи котов"
    },
    "catsDiff": {
      "title": "Разность",
      "desc": "Сщсчитай котов"
    }
  },
  "schoolProgram": {
    "firstGrade": "Первый класс",
    "secondGrade": "Второй класс",
    "thirdGrade": "Третий класс"
  },
  "profile": {
    "changePassword": {
      "inputs": {
        "oldPassword": {
          "placeholder": "Введите ваш старый пароль"
        }
      }
    },
    "changeAvatar": {
      "title": "Кто ты из Rick & Morty?",
      "button": "Выбрать",
      "name": "Имя",
      "location": "Местоположение",
      "status": "Статус",
      "species": "Вид",
      "changeAvatar": "Выбери свой аватар",
      "youAre": "Вы ",
      "fromRickMorty": " из Рика и Морти"
    }
  },
  "yourScore": {
    "total": "Общий счет"
  },
  "instructions": {
    "withoutRegister": {
      "title": "Функции доступные без регистрации",
      "allowedTools": {
        "1": {
          "title": "При запуске приложения пользователю доступен общедоступный тренажер для изучения математики."
        },
        "2": {
          "title": "Доступные математические операции: сложение, вычитание, умножение и деление."
        },
        "3": {
          "title": "Пользователь может проходить упражнения без ограничений, но не имеет доступа к дополнительным функциям и персонализации."
        },
        "4": {
          "title": "Баллы XP, набранные в тренажере обнуляются при завершении сеанса использования"
        }
      }
    },
    "register": {
      "title": "Регистрация пользователя",
      "allowedTools": {
        "1": {
          "title": "При выборе регистрации через электронную почту:",
          "desc": {
            "1": "Пользователь вводит свой адрес электронной почты и желаемый пароль.",
            "2": "После ввода данных пользователь нажимает кнопку 'Зарегистрироваться'.",
            "3": "Приложение отправляет на указанный адрес электронной почты письмо с ссылкой для подтверждения регистрации.",
            "4": "Пользователь переходит по ссылке из письма для подтверждения регистрации.",
            "5": "После подтверждения регистрации пользователь получает доступ к дополнительным функциям и персонализации приложения."
          }
        },
        "2": {
          "title": "При выборе регистрации через провайдера Google:",
          "desc": {
            "1": "Пользователь нажимает на кнопку 'Регистрация через Google'.",
            "2": "Приложение перенаправляет пользователя на страницу авторизации Google.",
            "3": "Пользователь вводит свои учетные данные Google и разрешает доступ к данным приложения.",
            "4": "После успешной аутентификации приложение получает доступ к профилю пользователя и создает новую учетную запись.",
            "5": "Пользователь получает доступ к дополнительным функциям и персонализации приложения."
          }
        }
      }
    },
    "passwordRecover": {
      "title": "Bосстановление пароля",
      "allowedTools": {
        "1": {
          "title": "Запрос на восстановление пароля:",
          "desc": {
            "1": "Пользователь переходит на экран восстановления пароля и вводит свой адрес электронной почты.",
            "2": "После ввода адреса электронной почты пользователь нажимает кнопку 'Отправить'."
          }
        },
        "2": {
          "title": "Отправка ссылки для сброса пароля:",
          "desc": {
            "1": "Приложение отправляет на указанный адрес электронной почты письмо с ссылкой для сброса пароля.",
            "2": "Письмо содержит инструкции о том, как сбросить пароль, а также ссылку, по которой пользователь может перейти для сброса пароля."
          }
        },
        "3": {
          "title": "Сброс пароля:",
          "desc": {
            "1": "Пользователь переходит по ссылке из письма.",
            "2": "При переходе по ссылке открывается страница сброса пароля, где пользователь может ввести новый пароль.",
            "3": "Пользователь вводит новый пароль дважды для подтверждения.",
            "4": "После ввода нового пароля пользователь нажимает кнопку 'Сбросить пароль'."
          }
        },
        "4": {
          "title": "Подтверждение сброса пароля:",
          "desc": {
            "1": "При успешном сбросе пароля приложение перенаправляет пользователя на страницу входа.",
            "2": "Пользователь может использовать новый пароль для входа в приложение."
          }
        }
      }
    },
    "changePassword": {
      "title": "Изменение пароля",
      "allowedTools": {
        "1": {
          "title": "Начало процесса изменения пароля:",
          "desc": {
            "1": "Пользователь переходит на экран изменения пароля в настройках аккаунта.",
            "2": "Пользователь вводит свой текущий пароль и новый пароль, а затем нажимает кнопку 'Изменить пароль'."
          }
        },
        "2": {
          "title": "Проверка текущего пароля:",
          "desc": {
            "1": "Приложение проверяет введенный пользователем текущий пароль на соответствие сохраненному в базе данных.",
            "2": "Если текущий пароль введен неверно, приложение отображает сообщение об ошибке и просит пользователя повторно ввести пароль."
          }
        },
        "3": {
          "title": "Ввод нового пароля:",
          "desc": {
            "1": "Если текущий пароль введен верно, пользователь вводит новый пароль дважды для подтверждения.",
            "2": "Пользователь нажимает кнопку 'Изменить пароль'."
          }
        },
        "4": {
          "title": "Сохранение нового пароля:",
          "desc": {
            "1": "Приложение сохраняет новый пароль в базе данных, связывая его с аккаунтом пользователя.",
            "2": "Пользователю отображается сообщение об успешном изменении пароля."
          }
        },
        "5": {
          "title": "Переход к входу:",
          "desc": {
            "1": "После успешного изменения пароля пользователь может использовать новый пароль для входа в приложение."
          }
        }
      }
    },
    "changeEmail": {
      "title": "Смена адреса электронной почты",
      "allowedTools": {
        "1": {
          "title": "Начало процесса смены email:",
          "desc": {
            "1": "Пользователь переходит на экран изменения адреса электронной почты в настройках аккаунта.",
            "2": "Пользователь вводит свой текущий адрес электронной почты и новый адрес электронной почты, а затем нажимает кнопку 'Сменить email'."
          }
        },
        "2": {
          "title": "Проверка текущего email:",
          "desc": {
            "1": "Приложение проверяет введенный пользователем текущий адрес электронной почты на соответствие сохраненному в базе данных.",
            "2": "Если текущий адрес электронной почты введен неверно или не существует, приложение отображает сообщение об ошибке и просит пользователя повторно ввести адрес."
          }
        },
        "3": {
          "title": "Ввод нового email:",
          "desc": {
            "1": "Если текущий адрес электронной почты введен верно, пользователь вводит новый адрес электронной почты.",
            "2": "Пользователь нажимает кнопку 'Сменить email'."
          }
        },
        "4": {
          "title": "Сохранение нового email:",
          "desc": {
            "1": "Приложение сохраняет новый адрес электронной почты в базе данных, связывая его с аккаунтом пользователя.",
            "2": "Пользователю отображается сообщение об успешном изменении адреса электронной почты."
          }
        }
      }
    },
    "changeAvatar": {
      "title": "Смена аватара",
      "allowedTools": {
        "1": {
          "title": "Начало процесса смены аватара:",
          "desc": {
            "1": "Пользователь переходит на экран изменения аватара в настройках аккаунта.",
            "2": "Пользователь просматривает доступные аватары, которые подгружаются из API Rick and Morty.",
            "3": "Пользователь выбирает желаемый аватар, нажимает на него для выбора."
          }
        },
        "2": {
          "title": "Сохранение выбранного аватара:",
          "desc": {
            "1": "Приложение сохраняет выбранный аватар в базе данных, связывая его с аккаунтом пользователя.",
            "2": "Пользователю отображается сообщение об успешной смене аватара."
          }
        }
      }
    },
    "preSchool": {
      "title": "Подготовка к школе",
      "desc": "Добро пожаловать в модуль подготовки к школе! Этот модуль предназначен для того, чтобы ваш ребенок мог освоить основы математики перед поступлением в школу. В этом модуле ваш ребенок сможет самостоятельно решать различные задания, изучая числа и развивая навыки счета. Прежде чем начать использовать модуль, убедитесь, что ваш ребенок зарегистрирован в нашем приложении. Регистрация позволит сохранять прогресс и зарабатывать опытные баллы (XP) за выполнение заданий. После успешной регистрации и входа в приложение ваш ребенок сможет получить доступ к модулю подготовки к школе. В этом модуле ваш ребенок будет изучать числа, решая различные несложные задания. Задания будут включать в себя счет, сравнение чисел, а также основные арифметические операции. Каждое выполненное задание принесет вашему ребенку опытные баллы (XP). Чем больше заданий решит ваш ребенок, тем больше XP он или она заработает. Ваш ребенок сможет отслеживать свой прогресс в модуле и видеть свои достижения. Мы также будем отмечать его или ее успехи и поощрять за преодоление новых математических вызовов! Надеемся, что ваш ребенок будет наслаждаться изучением математики с помощью нашего модуля подготовки к школе! Если у вас возникнут вопросы или замечания, не стесняйтесь обращаться к нам."
    },
    "schoolProgram": {
      "title": "Школьная программа",
      "desc": "После регистрации пользователь получает доступ к модулю школьной программы для 1-3 классов. Каждый класс содержит обучающие материалы по математике для соответствующего уровня. Пользователь может перемещаться между классами и получать доступ к обучающему контенту, адаптированному под уровень его ребенка. В этих материалах представлены интерактивные упражнения, примеры и объяснения, помогающие детям усвоить математические концепции эффективно. Кроме того, пользователи могут отслеживать прогресс и успехи своего ребенка в приложении, что позволяет создавать персонализированный опыт обучения. По мере развития приложения будут добавляться дополнительные школьные программы для других уровней, обеспечивая полноценные образовательные ресурсы для детей всех возрастов. Пользователь также сможет зарабатывать XP, которые будут отражать его прогресс в приложении."
    },
    "parentalControl": {
      "title": "Родительский контроль",
      "desc": "При регистрации пользователь может указать, что он является родителем, установив соответствующую отметку. Это дает доступ к модулю родительского контроля, где они могут зарегистрировать своего ребенка. После регистрации родители могут отслеживать прогресс и накопление очков опыта (XP) своего ребенка в приложении. Эта функция позволяет родителям активно участвовать в образовательном процессе своего ребенка и предоставляет им информацию о развитии его образования."
    }
  }
}