{
  "lang": "en",
  "screens": {
    "main": "Welcome",
    "home": "Home",
    "instructions": "Instructions",
    "math": "Math Examples",
    "preSchool": "Pre-school",
    "schoolProgram": "School program 1-3 grades",
    "login": "Login",
    "register": "Registration",
    "verify": "Verify",
    "logout": "Logout",
    "forgotPassword": "Forgot password",
    "createNewPassword": "Create new password",
    "changeEmail": "Change email",
    "changePassword": "Change password",
    "changeAvatar": "Choose avatar",
    "profile": "Profile",
    "yourScore": "Your score"
  },
  "main": {
    "desc": "This is a web version of mobile app. It is in development mode"
  },
  "changeLang": {
    "select": "Change language",
    "options": {
      "en": "English",
      "ru": "Russian"
    }
  },
  "buttons": {
    "submit": "Submit",
    "logout": "Logout",
    "login": "Login",
    "register": "Register"
  },
  "modal": {
    "registrationSuccess": "Registration was successfull",
    "changePasswordSuccess": "Your password was changed successfully",
    "fail": "Something went wrong. Please, try later",
    "linkSent": "We've sent you a link to verify your email. Check your mail, please",
    "forgotPassword": "Please, check your email",
    "checkMathOperationSuccess": "Right answer!",
    "checkMathOperationFail": "Wrong! Please, try again",
    "changeAvatarSuccess": "Your avatar was changed successfully",
    "button": "Ok"
  },
  "links": {
    "back": "Back"
  },
  "errors": {
    "serverError": "There is no connection to the server. Please, try later",
    "someError": "Some error occured",
    "error400register": "User with this email already exists",
    "error400login": "User password not correct",
    "error401login": "User not found",
    "required": "Field required",
    "latinLetters": "Only latin letters are supported",
    "min": "Field length should be at least 4 characters",
    "max": "Field cannot exceed more than 64 characters",
    "notMatch": "Passwords do not match",
    "mustBeEmail": "Email must be an email",
    "logout": "User not authorized. First log in and then you can log out"
  },
  "auth": {
    "changePassword": {
      "inputs": {
        "password": {
          "label": "Your old password",
          "placeholder": "Enter your old password"
        },
        "newPassword": {
          "label": "Your new password",
          "placeholder": "Enter your new password"
        },
        "newPasswordConfirmation": {
          "label": "New password confirmation",
          "placeholder": "Enter your new password confirmation"
        }
      }
    },
    "changeEmail": {
      "inputs": {
        "newEmail": {
          "label": "Your new email",
          "placeholder": "Enter your new email"
        }
      }
    },
    "login": {
      "inputs": {
        "email": {
          "label": "Email",
          "placeholder": "Enter your email"
        },
        "password": {
          "label": "Password",
          "placeholder": "Enter your password"
        },
        "rememberMe": "Remember me"
      },
      "note": "If you don't have an account, go to registration page"
    },
    "register": {
      "inputs": {
        "passwordConfirmation": {
          "label": "Password confirmation",
          "placeholder": "Enter your password confirmation"
        }
      },
      "note": "If you already have an account, go to login page"
    },
    "logout": {
      "sure": "Are you sure?"
    },
    "verify": {
      "success": "Your email is verified successfully",
      "error": "Some error occured during verification, go to registration page again"
    },
    "forgotPassword": {
      "note": "If you forget your password, follow the link below"
    }
  },
  "home": {
    "hello": "Hello"
  },
  "mathOperations": {
    "common": {
      "generate": "Generate new numbers",
      "generateCats": "Generate new cats",
      "check": "Check",
      "right": "You are right!",
      "notRight": "You are not right",
      "more": "Play more?",
      "again": "Try again?",
      "choose": "Choose a number:",
      "getHint": "Get a hint"
    },
    "diff": "Difference",
    "sum": "Sum",
    "multiplication": "Multiplication",
    "multTable": "Multiplication table",
    "multBy": "Multiplication by",
    "multCheck": "Check multiplication knowledge",
    "multNulls": "Multiplication of numbers with nulls",
    "equations": "Equations",
    "equationsWithX": "Equations with 1 unknown",
    "equationsWithXY": "Equations with 2 unknown"
  },
  "preSchool": {
    "numbers": {
      "title": "Numbers",
      "desc": "Count cats"
    }
  },
  "schoolProgram": {
    "firstGrade": "First grade",
    "secondGrade": "Second grade",
    "thirdGrade": "Third grade"
  },
  "profile": {
    "changePassword": {
      "inputs": {
        "oldPassword": {
          "placeholder": "Enter your old password"
        }
      }
    },
    "changeEmail": {
      "inputs": {
        "oldPassword": {
          "placeholder": "Enter your new email"
        }
      }
    },
    "changeAvatar": {
      "title": "Who are you from Rick & Morty?",
      "button": "Choose",
      "name": "Name",
      "location": "Location",
      "status": "Status",
      "species": "Species",
      "changeAvatar": "Choose your avatar",
      "youAre": "You are ",
      "fromRickMorty": " from Rick and Morty"
    }
  },
  "yourScore": {
    "total": "Your total score"
  },
  "instructions": {
    "withoutRegister": {
      "title": "Features available without registration",
      "allowedTools": {
        "1": {
          "title": "Upon launching the application, the user has access to a public math trainer for learning mathematics."
        },
        "2": {
          "title": "Available mathematical operations: addition, subtraction, multiplication, and division."
        },
        "3": {
          "title": "The user can complete exercises without restrictions but does not have access to additional features and personalization."
        },
        "4": {
          "title": "XP points earned in the trainer are reset at the end of each session."
        }
      }
    },
    "register": {
      "title": "User Registration",
      "allowedTools": {
        "1": {
          "title": "When choosing registration via email:",
          "desc": {
            "1": "The user enters their email address and desired password.",
            "2": "After entering the information, the user clicks the 'Register' button.",
            "3": "The application sends an email to the provided email address with a registration confirmation link.",
            "4": "The user follows the link from the email to confirm the registration.",
            "5": "After confirming the registration, the user gains access to additional features and app personalization."
          }
        },
        "2": {
          "title": "When choosing registration via Google provider:",
          "desc": {
            "1": "The user clicks on the 'Register with Google' button.",
            "2": "The application redirects the user to the Google authentication page.",
            "3": "The user enters their Google credentials and grants access to the application's data.",
            "4": "After successful authentication, the application gains access to the user's profile and creates a new account.",
            "5": "The user gains access to additional features and app personalization."
          }
        }
      }
    },
    "passwordRecover": {
      "title": "Password Recovery",
      "allowedTools": {
        "1": {
          "title": "Password recovery request:",
          "desc": {
            "1": "The user navigates to the password recovery screen and enters their email address.",
            "2": "After entering the email address, the user clicks the 'Send' button."
          }
        },
        "2": {
          "title": "Sending password reset link:",
          "desc": {
            "1": "The application sends an email to the provided email address with a password reset link.",
            "2": "The email contains instructions on how to reset the password, as well as a link for the user to click to reset their password."
          }
        },
        "3": {
          "title": "Resetting the password:",
          "desc": {
            "1": "The user clicks the link from the email.",
            "2": "Upon clicking the link, a password reset page opens where the user can enter a new password.",
            "3": "The user enters the new password twice for confirmation.",
            "4": "After entering the new password, the user clicks the 'Reset Password' button."
          }
        },
        "4": {
          "title": "Password reset confirmation:",
          "desc": {
            "1": "Upon successful password reset, the application redirects the user to the login page.",
            "2": "The user can use the new password to log into the application."
          }
        }
      }
    },
    "changePassword": {
      "title": "Change Password",
      "allowedTools": {
        "1": {
          "title": "Beginning of password change process:",
          "desc": {
            "1": "The user navigates to the password change screen in the account settings.",
            "2": "The user enters their current password and new password, then clicks the 'Change Password' button."
          }
        },
        "2": {
          "title": "Checking the current password:",
          "desc": {
            "1": "The application checks the current password entered by the user against the one stored in the database.",
            "2": "If the current password is entered incorrectly, the application displays an error message and prompts the user to re-enter the password."
          }
        },
        "3": {
          "title": "Entering a new password:",
          "desc": {
            "1": "If the current password is entered correctly, the user enters the new password twice for confirmation.",
            "2": "The user clicks the 'Change Password' button."
          }
        },
        "4": {
          "title": "Saving the new password:",
          "desc": {
            "1": "The application saves the new password in the database, associating it with the user's account.",
            "2": "The user sees a message indicating successful password change."
          }
        },
        "5": {
          "title": "Transition to login:",
          "desc": {
            "1": "After successfully changing the password, the user can use the new password to log into the application."
          }
        }
      }
    },
    "changeEmail": {
      "title": "Change Email Address",
      "allowedTools": {
        "1": {
          "title": "Beginning of email change process:",
          "desc": {
            "1": "The user navigates to the email change screen in the account settings.",
            "2": "The user enters their current email address and new email address, then clicks the 'Change Email' button."
          }
        },
        "2": {
          "title": "Checking the current email:",
          "desc": {
            "1": "The application checks the current email address entered by the user against the one stored in the database.",
            "2": "If the current email address is entered incorrectly or does not exist, the application displays an error message and prompts the user to re-enter the address."
          }
        },
        "3": {
          "title": "Entering a new email address:",
          "desc": {
            "1": "If the current email address is entered correctly, the user enters the new email address.",
            "2": "The user clicks the 'Change Email' button."
          }
        },
        "4": {
          "title": "Saving the new email address:",
          "desc": {
            "1": "The application saves the new email address in the database, associating it with the user's account.",
            "2": "The user sees a message indicating successful email address change."
          }
        }
      }
    },
    "changeAvatar": {
      "title": "Change Avatar",
      "allowedTools": {
        "1": {
          "title": "Beginning of avatar change process:",
          "desc": {
            "1": "The user navigates to the avatar change screen in the account settings.",
            "2": "The user browses available avatars, which are loaded from the Rick and Morty API.",
            "3": "The user selects the desired avatar and clicks on it to confirm the selection."
          }
        },
        "2": {
          "title": "Saving the selected avatar:",
          "desc": {
            "1": "The application saves the selected avatar in the database, associating it with the user's account.",
            "2": "The user sees a message indicating successful avatar change."
          }
        }
      }
    },
    "preSchool": {
      "title": "Pre-school",
      "desc": "Welcome to the preparation for school module! This module is designed to help your child master the basics of mathematics before entering school. In this module, your child will be able to independently solve various tasks, learning numbers and developing counting skills. Before starting to use the module, make sure that your child is registered in our application. Registration will allow to save progress and earn experience points (XP) for completing tasks. After successful registration and login to the application, your child will be able to access the preparation for school module. In this module, your child will learn numbers by solving various simple tasks. Tasks will include counting, comparing numbers, as well as basic arithmetic operations. Each completed task will earn your child experience points (XP). The more tasks your child completes, the more XP he or she will earn. Your child will be able to track progress in the module and see achievements. We will also celebrate his or her successes and encourage overcoming new mathematical challenges! We hope that your child will enjoy learning mathematics with the help of our preparation for school module! If you have any questions or comments, feel free to contact us."
    },
    "schoolProgram": {
      "title": "School program",
      "desc": "After registration, the user gains access to the school program module for grades 1-3. Each class contains educational materials on mathematics for the corresponding grade. The user can navigate through the classes and access the learning materials tailored to their child's grade level. These materials include interactive exercises, examples, and explanations to help children grasp mathematical concepts effectively. Additionally, users can track their child's progress and performance within the app, allowing for personalized learning experiences. As the app continues to evolve, additional school programs for other grade levels will be added, providing a comprehensive educational resource for children of all ages. Users will also be able to earn XP, which will reflect their progress in the app."
    },
    "parentalControl": {
      "title": "Parental Control",
      "desc": "During registration, the user can indicate that they are a parent by checking a box. This grants them access to the parental control module, where they can register their child. Once registered, parents can monitor their child's progress and XP accumulation within the app. This feature allows parents to actively engage in their child's learning journey and provides them with insights into their child's educational development."
    }
  }  
}